size = int(input("โปรดระบุขนาดของ Stack ที่มีขนาดตั้งแต่ 5 ช่องขึ้นไป : "))

while size < 5:
    size = int(input("โปรดระบุขนาดของ Stack ที่มีขนาดตั้งแต่ 5 ช่องขึ้นไป : "))

stack = [] * size

print("โปรดระบุทางเลือกในการดำเนินการกับ Stack")
print("1. เพิ่มข้อมูลใน stack")
print("2. ลบข้อมูลที่จัดเก็บในตำแหน่งบนสุดของ stack")
print("3. แสดงข้อมูลที่จัดเก็บในตำแหน่งบนสุดของ Stack ทางจอภาพ")
print("4. แสดงข้อมูลทั้งหมดที่จัดเก็บใน Stack ทางจอภาพ")
print("5. แสดงค่ามากที่สุดและค่าน้อยที่สุดของข้อมูลที่จัดเก็บใน Satck ทางจอภาพ \n")
choise = int(input("ทางเลือกในการดำเนินการ = "))

while choise >= 1 and choise <= 5:
    print("โปรดระบุทางเลือกในการดำเนินการกับ Stack")
    print("1. เพิ่มข้อมูลใน stack")
    print("2. ลบข้อมูลที่จัดเก็บในตำแหน่งบนสุดของ stack")
    print("3. แสดงข้อมูลที่จัดเก็บในตำแหน่งบนสุดของ Stack ทางจอภาพ")
    print("4. แสดงข้อมูลทั้งหมดที่จัดเก็บใน Stack ทางจอภาพ")
    print("5. แสดงค่ามากที่สุดและค่าน้อยที่สุดของข้อมูลที่จัดเก็บใน Satck ทางจอภาพ \n")
    choise = int(input("ทางเลือกในการดำเนินการ = "))
    if choise == 1:
        print("ทางเลือกในการดำเนินการ = 1")
        data = input("ข้อมูลที่ต้องการจัดเก็บข้อมูลใน Stack = ")
        if len(stack) == size:
            print("จัดเก็บข้อมูลไม่ได้เพราะ Stack เต็ม")
        else:
            stack.append(data)
    elif choise == 2:
        print("ทางเลือกในการดำเนินการ = 2")
        n = len(stack)
        if n != 0:
            stack.pop()
        else:
            print("ลบข้อมูลไม่ได้เพราะ Stack ว่าง ")
    elif choise == 3:
        print("ทางเลือกในการดำเนินการ = 3")
        n = len(stack)
        if n != 0:
            print("ข้อมูลที่จัดเก็บในตำแหน่งบนสุดของ Stack คือ ", stack[-1])
        else:
            print("แสดงข้อมูลที่จัดเก็บในตำแหน่งสูงสุดของ Stack ไม่ได้เพราะ Satck ว่าง")
    elif choise == 4:
        print("ทางเลือกในการดำเนินการ = 4")
        n = len(stack)
        if n != 0:
            print("ข้อมูล = ", stack)
        else:
            print("แสดงข้อมูลใน Stack ไม่ได้เพราะ Stack ว่าง")
    elif choise == 5:
        print("ทางเลือกในการดำเนินการ = 5")
        n = len(stack)
        if n != 0:
            print("ค่ามากที่สุดของข้อมูลใน Stack คือ ", max(stack))
            print("ค่าน้อยที่สุดของข้อมูลใน Stack คือ ", min(stack))
        else:
            print(
                "แสดงค่ามากที่สุดและค่าน้อยที่สุดของข้อมูลใน Stack ไม่ได้เพราะ Stack ว่าง"
            )
